/*-------------------------------------------------------------------------------
文件名称：main.c
文件描述：控制LED2，LED3闪烁
硬件平台：尼莫M3S开发板
编写整理：shifang
固件库  ：V3.5
技术论坛：www.doflye.net
备    注：通过简单修改可以移植到其他开发板，部分资料来源于网络。
---------------------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "led.h"

int main(void)
{
	
uint32_t i; //定义32位数
LED_Init(); //初始化LED

LED2_ON;
LED3_OFF;
for(i=0;i<0xfffff;i++);//for循环不精确延时	
while(1)
 {
  for(i=0;i<0xffffff;i++);//for循环不精确延时
	LED2_REV;//LED2取反
	LED3_REV;//LED3取反
 } 
}
/*----------------------德飞莱 技术论坛：www.doflye.net--------------------------*/
